<template>
  <el-main>
    <div class="file-container">
      <h1 class="file-title">文件预览</h1>
      <div class="preview">
        中共中央关于加强党的政治建设的意见
        新华社北京2月27日电中共中央关于加强党的政治建设的意见
        （2019年1月31日）
        为深入贯彻落实习近平新时代中国特色社会主义思想和党的十九大精神，切实加强党的政治建设，坚持和加强党的全面领导，推进全面从严治党向纵深发展，不断提高党的执政能力和领导水平，确保全党统一意志、统一行动、步调一致向前进，现提出如下意见。
        一、加强党的政治建设的总体要求
        旗帜鲜明讲政治是我们党作为马克思主义政党的根本要求。党的政治建设是党的根本性建设，决定党的建设方向和效果，事关统揽推进伟大斗争、伟大工程、伟大事业、伟大梦想。
        在革命、建设、改革各个时期，我们党都高度重视党的政治建设，形成了讲政治的优良传统。党的十八大以来，以习近平同志为核心的党中央把党的政治建设摆在更加突出位置，加大力度抓，形成了鲜明的政治导向，消除了党内严重政治隐患，推动党的政治建设取得重大历史性成就。同时，必须清醒看到，党内存在的政治问题还没有得到根本解决，一些党组织和党员干部忽视政治、淡化政治、不讲政治的问题还比较突出，有的甚至存在偏离中国特色社会主义方向的严重问题。切实有效解决这些问题，必须进一步加强党的政治建设。
        加强党的政治建设，必须高举中国特色社会主义伟大旗帜，全面贯彻党的十九大精神，坚持以马克思列宁主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观、习近平新时代中国特色社会主义思想为指导，坚持党的基本理论、基本路线、基本方略，落实新时代党的建设总要求，增强“四个意识”，坚定“四个自信”，坚决维护习近平总书记党中央的核心、全党的核心地位，坚决维护党中央权威和集中统一领导，把准政治方向，坚持党的政治领导，夯实政治根基，涵养政治生态，防范政治风险，永葆政治本色，提高政治能力，把我们党建设得更加坚强有力，确保我们党始终成为中国特色社会主义事业的坚强领导核心，为实现“两个一百年”奋斗目标和中华民族伟大复兴的中国梦提供坚强政治保证。
        加强党的政治建设，目的是坚定政治信仰，强化政治领导，提高政治能力，净化政治生态，实现全党团结统一、行动一致。要以党章为根本遵循，把党章明确的党的性质和宗旨、指导思想和奋斗目标、路线和纲领落到实处。要突显党的政治建设的根本性地位，聚焦党的政治属性、政治使命、政治目标、政治追求持续发力。要以党的政治建设为统领，把政治标准和政治要求贯穿党的思想建设、组织建设、作风建设、纪律建设以及制度建设、反腐败斗争始终，以政治上的加强推动全面从严治党向纵深发展，引领带动党的建设质量全面提高。要坚持问题导向，注重“靶向治疗”，针对政治意识不强、政治立场不稳、政治能力不足、政治行为不端等突出问题强弱项补短板。要把党的政治建设融入党和国家重大决策部署的制定和落实全过程，做到党的政治建设与各项业务工作特别是中心工作紧密结合、相互促进。
      </div>
      <div class="download-btn">
        <el-button type="primary">下载</el-button>
      </div>
    </div>
  </el-main>
</template>
<script>
export default {
  data() {
    return {};
  }
};
</script>

<style scoped>
.el-main {
  padding-top: 60px;
  width: 1000px;
  margin: 0 auto;
}
.el-row {
  padding: 20px 0;
}

.file-container {
  padding: 20px;
  background: #fff;
  margin-top: 20px;
}
.file-title {
  font-size: 18px;
  line-height: 40px;
  border: 1px solid #e4e7ed;
  background: #e4e7ed;
  padding: 0 15px;
  border-radius: 3px;
}
.preview {
  /* width: 1000px;
  margin: 0 auto; */
  padding: 30px 0;
}
.download-btn {
  text-align: center;
}
</style>



